# Задача 2.	Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# ============================================================================

def Mult_List(n_list):
    mult = [] 
    for i in range(len(n_list) // 2):
        mult.append(n_list[i] * n_list[-1 -i])
    if len(n_list)%2 != 0:
        mult.append((n_list[len(n_list) // 2])**2)
    return mult

num1 = [2, 3, 4, 5, 6]
num2 = [2, 3, 5, 6]
num3 = [5, 7, 2, 9, 3, 8, 4, 1, 6, 3, 7]

mult1 = Mult_List(num1)
mult2 = Mult_List(num2)
mult3 = Mult_List(num3)

print("\nПроизведение пар чисел первого списка: ", mult1)
print("Произведение пар чисел второго списка: ", mult2)
print("Произведение пар чисел третьего списка: ", mult3)
