# Задача 3. Измените код одной-двух решенных ранее задач
# (с прошлых семинаров или домашних работ), применив лямбды,
# filter, map, zip, enumerate, списочные выражения.
# ===========================================================

number = input("\nВведите вещественное число: ")
print("\nПрежнее решение.")
sum_digit = 0
for char in number:
    if char.isdigit():
        sum_digit += int(char)

print("  Сумма цифр введённого числа =", sum_digit)

print("\nРешение с lambda, map, filter: ")
res = list(map(lambda s: int(s), filter(lambda s: s.isdigit(), number)))
print("  Сумма цифр введённого числа =", sum(res))
print("\n===============================================================")

# ===================================================================
# Задача 3.	Задайте список из вещественных чисел. Напишите программу,
# которая найдёт разницу между максимальным и минимальным значением 
# дробной части элементов.
# ====================================================================
print("\nПрошлое решение задачи.")
num_list = [1.1, 1.2, 3.1, 5, 10.01]

n_list = []
for i in range(len(num_list)):
    temp = round((num_list[i] - int(num_list[i])), 2)
    if temp != 0:
        n_list.append(temp)
print(n_list)
print("\nРазница между max и min дробной части чисел: ", max(n_list) - min(n_list))

print("\n  Решение задачи со списочным выражением.")
n_l = [round((x - int(x)), 2)  for x in num_list if ((x - int(x))) != 0]
print(n_l)
print("\n  Разница между max и min дробной части чисел: ", max(n_l) - min(n_l))
